Autodesk.Revit.DB.Analysis.FieldValues.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Analysis.FieldValues.#ctor(Autodesk.Revit.DB.Analysis.FieldValues)
Creates a copy of the given FieldValues instance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.FieldValues.#ctor(System.Collections.Generic.IList{Autodesk.Revit.DB.Analysis.VectorAtPoint})
Creates object from an array of domain point vectors
vectorAtPoint:
Array of vectors, each corresponding to a domain point
Throws Autodesk.Revit.Exceptions.ArgumentException:
Members of vectorAtPoint contain different numbers of measurements
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.FieldValues.#ctor(System.Collections.Generic.IList{Autodesk.Revit.DB.Analysis.ValueAtPoint},Autodesk.Revit.DB.XYZ)
Creates object from an array of domain point values
valueAtPoint:
Array of values, each corresponding to a domain point
unitDirection:
Unit vector that gives the same direction for values (for diagrams)
Throws Autodesk.Revit.Exceptions.ArgumentException:
Members of valueAtPoint contain different numbers of measurements
-or-
unitDirection is not a unit vector
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.FieldValues.#ctor(System.Collections.Generic.IList{Autodesk.Revit.DB.Analysis.ValueAtPoint})
Creates object from an array of domain point values
valueAtPoint:
Array of values, each corresponding to a domain point
Throws Autodesk.Revit.Exceptions.ArgumentException:
valueAtPoint array contains members with different numbers of measurements
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.FieldValues
Contains values corresponding to domain points.
Each domain point may have an array of values, each corresponding to a separate "measurement" for which this value was calculated.
Since:
2011